#include<stdio.h>
//#include<stdlib.h>
/*------------------------------------------------------------------------------
输入的一个正整数N (N<5000000)，则开根号的N为2237 
------------------------------------------------------------------------------*/
int function(long n)
{
	int a,b,c,d;
	for(a=0;a<2237;a++)
		for(b=a;b<2237;b++)
		{
			if(n<a*a+b*b) break;
			for(c=b;c<2237;c++)
			{
				if(n<a*a+b*b+c*c) break;
				for(d=c;d<2237;d++)
				{
					if(n<a*a+b*b+c*c+d*d) break;
					if(n==a*a+b*b+c*c+d*d)
					{
						printf("%d %d %d %d",a,b,c,d);
						return 0;
					}
				}
			}
		}
	return 0;
} 
/*------------------------------------------------------------------------------

------------------------------------------------------------------------------*/
int main()
{
	long number;
	scanf("%ld",&number);
	function(number);
	return 0;
}
