#include<stdio.h>
#define Max 100 
/*------------------------------------------------------------------------------

------------------------------------------------------------------------------*/

int number;//记录输入整数个数
long data[Max];//记录输入的整数值 
int ratio_num1=0,ratio_num2=0;//等比数列的最大公比

/*------------------------------------------------------------------------------
计算等比数列的最大公比
------------------------------------------------------------------------------*/
void function(int data_temp[],int n)
{
	/*从小到大排序，且去掉重复的数*/
	int i,j,temp;
	int temp[Max];
	for(i=0;i<n;i++)
		for(j=i;j<n;j++)
		{
			if(data_temp[i]>data_temp[j])
			{
				temp=data_temp[i];
				data_temp[i]=data_temp[j];
				data_temp[j]=temp;
			}
		}
	//取商
	for(i=1,j=0;i<n;i++)
	{
		if(data_temp[i-1]==data_temp[i]) continue;
		temp[j++]=data_temp[i]/data_temp[i-1];
	} 
}

/*------------------------------------------------------------------------------
实现分子分母互质 
------------------------------------------------------------------------------*/
void ratio(int num1,int num2)
{
	
}

/*------------------------------------------------------------------------------
主函数 
------------------------------------------------------------------------------*/
int main()
{
	int i;
	scanf("%d",&number);
	for(i=0;i<number;i++)
	{
		scanf("%ld",&data[i]);
	}
	function(data,number);//计算等比数列的最大公比
	ratio(ratio_num1,ratio_num2);//实现分子分母互质 
	printf("%d/%d",ratio_num1,ratio_num2);
	return 0;
}
