#include<stdio.h>
#define Max 10000
/*------------------------------------------------------------------------------

------------------------------------------------------------------------------*/
int number;//瓶子的数目
int data[Max];//存放瓶子目前的排列情况
int count=0;//交换瓶子的次数
 
/*------------------------------------------------------------------------------
排序函数 function() 
------------------------------------------------------------------------------*/
void function()
{
	/*
	  min记录最小数
	  min_sub记录最小数下标
	  temp交换值时作为临时变量
	*/
	int i,j,min,min_sub,temp;
	for(i=0;i<number;i++)
	{
		min=data[i];
		min_sub=i;
		for(j=i;j<number;j++)
		{
			if(min>data[j])
			{
				min=data[j];
				min_sub=j;
			}	
		}
		if(min_sub!=i)
		{
			count++;
			temp=data[i];
			data[i]=data[min_sub];
			data[min_sub]=temp;
		}
	}
} 
 
 /*------------------------------------------------------------------------------

------------------------------------------------------------------------------*/
int main()
{
	int i;
	scanf("%d",&number); 
	for(i=0;i<number;i++)
	{
		scanf("%d",&data[i]);
	}
	function();//计算交换的次数 
	printf("%d",count);
	return 0;
}
